DataProcessors/ЗагрузкаКонтрагентовИзExcel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКонтрагентовИзExcel</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиНаименование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКолонкиВида</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ГруппаФизЛиц</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ГруппаЮрЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЮрФизЛицо</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидКонтрагента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическийАдрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресEMail</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дополнительно</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ВидКонтрагента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидКонтрагента</Name>
			<Comment>Вид контрагента</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ЗагрузкаКонтрагентовИзExcel/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ОбщийМодульСервер.НастройкаПользователя("РазрешеноВыгружатьИЗагружатьКонтрагентовИзФайловXLS") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл";
	ДиалогВыбора.Фильтр = "Файл Excel (*.xlsx;*.xls)|*.xlsx;*.xls|Все файлы (*.*)|*.*";
	
	Если ДиалогВыбора.Выбрать() Тогда
		Объект.ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	Если не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	//подключаемся к эксел
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(Объект.ПутьКФайлу);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	КоличествоСтрок = Excel.Cells(1,1).SpecialCells(11).Row;
	
	Таб = Объект.СписокКонтрагентов;
	Если Таб.Количество() > 0 Тогда
		ПоказатьОповещениеПользователя("Список контрагентов для загрузки очищен");
	КонецЕсли;
	Таб.Очистить();
	//Отбор = Новый Структура;
	Для н = НомерСтроки по КоличествоСтрок Цикл
		Наименование = Excel.Cells(н,Объект.НомерКолонкиНаименование).Value;
		Если не ПустаяСтрока(Наименование) Тогда
			Контрагент = НайтиКонтрагента(Наименование);
			НовС = Таб.Добавить();
			Если Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка") Тогда 				
				НовС.Загружать = Истина;
			Иначе 
				НовС.Загружать = Ложь;
			КонецЕсли;
			
			НовС.Контрагент = Контрагент;
			НовС.Наименование = Наименование;
			
			// #17145 число на текст
			ЮрФизЛицо = Excel.Cells(н,Объект.НомерКолонкиВида).Value;
			Если ПустаяСтрока(ЮрФизЛицо) ИЛИ ВРег(СокрЛП(ЮрФизЛицо)) = ВРег("Юридическое лицо") Тогда //ЮрФизЛицо = 0 Тогда 
				НовС.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ВидКонтрагента.ЮрЛицо");
			//ИначеЕсли ЮрФизЛицо = 1 Тогда 
			ИначеЕсли ВРег(СокрЛП(ЮрФизЛицо)) = ВРег("Физическое лицо") Тогда
				НовС.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ВидКонтрагента.ФизЛицо");
			//ИначеЕсли ЮрФизЛицо = 2 Тогда
			ИначеЕсли ВРег(СокрЛП(ЮрФизЛицо)) = ВРег("Индивидуальный предприниматель") Тогда
				НовС.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ВидКонтрагента.ИндивидуальныйПредприниматель");
			Иначе
				НовС.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ВидКонтрагента.ПустаяСсылка");
			КонецЕсли;
			
			Если НЕ НомерКолонкиПолноеНаименование = 0 Тогда 
				ПолноеНаименование = Excel.Cells(н,НомерКолонкиПолноеНаименование).Value;
				Если ПустаяСтрока(ПолноеНаименование) Тогда 
					НовС.ПолноеНаименование = Наименование;
				Иначе 
					НовС.ПолноеНаименование = ПолноеНаименование;
				КонецЕсли;
			Иначе 
				НовС.ПолноеНаименование = Наименование;
			КонецЕсли;
			
			Если не НомерКолонкиСФактическимАдресом = 0 Тогда 
				НовС.ФактическийАдрес = Excel.Cells(н,НомерКолонкиСФактическимАдресом).Value;
			КонецЕсли;
			
			Если не НомерКолонкиСТелефоном = 0 Тогда 
				НовС.НомерТелефона = СтрЗаменить(Excel.Cells(н,НомерКолонкиСТелефоном).Value, Символы.НПП, "");
			КонецЕсли;
			
			Если не НомерКолонкиСEMail = 0 Тогда 
				НовС.АдресEMail = Excel.Cells(н,НомерКолонкиСEMail).Value;
			КонецЕсли;
			
			Если не НомерКолонкиСИНН = 0 Тогда 
				НовС.ИНН = СтрЗаменить(Excel.Cells(н,НомерКолонкиСИНН).Value, Символы.НПП, "");
			КонецЕсли;
			
			Если не НомерКолонкиСКПП = 0 Тогда 
				НовС.КПП =  СтрЗаменить(Excel.Cells(н,НомерКолонкиСКПП).Value, Символы.НПП, "");
			КонецЕсли;
			
			Если не НомерКолонкиСКомментарием = 0 Тогда 
				НовС.Дополнительно = Excel.Cells(н,НомерКолонкиСКомментарием).Value;
			КонецЕсли;
			
			Если не НомерКолонкиСДатойРождения = 0 Тогда 
				НовС.ДатаРождения = Excel.Cells(н,НомерКолонкиСДатойРождения).Value;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;  	
	
	//Закрыть Ексель после выполнения кода
	Excel.DisplayAlerts = 0; 
	Excel.Quit();
	Excel.DisplayAlerts = 1;

КонецПроцедуры

&НаСервере
Функция НайтиКонтрагента(Наименование)
	Возврат Справочники.Контрагенты.НайтиПоНаименованию(Наименование);
КонецФункции

&НаСервере
Процедура СоздатьКонтрагентовНаСервере()
	
	Для Каждого СтрокаТаблицы из Объект.СписокКонтрагентов Цикл
		Если СтрокаТаблицы.Загружать Тогда
			НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
			НовыйКонтрагент.Заполнить(Неопределено);
			
			//#17145
			НовыйКонтрагент.Родитель = Объект.ГруппаКонтрагентов;
			//Если СтрокаТаблицы.ЮрФизЛицо = Перечисления.ВидКонтрагента.ФизЛицо Тогда 
			//	НовыйКонтрагент.Родитель = Объект.ГруппаФизЛиц;
			//ИначеЕсли СтрокаТаблицы.ЮрФизЛицо = Перечисления.ВидКонтрагента.ЮрЛицо Тогда
			//	НовыйКонтрагент.Родитель = Объект.ГруппаЮрЛица;
			//КонецЕсли;
			НовыйКонтрагент.ВидКонтрагента = СтрокаТаблицы.ЮрФизЛицо;
			НовыйКонтрагент.Наименование = СтрокаТаблицы.Наименование;
			НовыйКонтрагент.НаименованиеПолное = СтрокаТаблицы.ПолноеНаименование;
			НовыйКонтрагент.ИНН = СтрокаТаблицы.ИНН;			
			НовыйКонтрагент.КПП = СтрокаТаблицы.КПП;
			НовыйКонтрагент.Дополнительно = СтрокаТаблицы.Дополнительно;
			НовыйКонтрагент.ДатаРождения = СтрокаТаблицы.ДатаРождения;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.АдресEMail) Тогда
				ВидИнформации = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
				ТипИнформации = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				
				ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(СтрокаТаблицы.АдресEMail, ВидИнформации);
				УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(НовыйКонтрагент, ЗначенияПолей, ВидИнформации, ТипИнформации);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.НомерТелефона) Тогда
				ВидИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
				ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
				
				ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(СтрокаТаблицы.НомерТелефона, ВидИнформации);
				УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(НовыйКонтрагент, ЗначенияПолей, ВидИнформации, ТипИнформации);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.ФактическийАдрес) Тогда
				ВидИнформации = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
				ТипИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
				
				ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(СтрокаТаблицы.ФактическийАдрес, ВидИнформации);
				УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(НовыйКонтрагент, ЗначенияПолей, ВидИнформации, ТипИнформации);
			КонецЕсли;
			
			// №6293 определяем для нового элемента группу доступа из карточки пользователя
			НовыйКонтрагент.ГруппаДоступа = ОбщийМодульСервер.НастройкаПользователя("ГруппаДоступаДляНовыхКонтрагентов");
			
			НовыйКонтрагент.Записать();
			НовыйКонтрагент.ОсновнойДоговор = ОбщийМодуль.УстановитьОсновнойДоговорКонтрагента(НовыйКонтрагент.Ссылка);
			НовыйКонтрагент.Записать();
			
			СтрокаТаблицы.Контрагент = НовыйКонтрагент.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКонтрагентов(Команда)
	
	Если Объект.СписокКонтрагентов.Количество() = 0 Тогда 
		Сообщить("Не получены данные из файла. Нажмите кнопку Прочитать файл");
		Возврат;
	КонецЕсли;
	
	СоздатьКонтрагентовНаСервере();
	ПоказатьПредупреждение(,"Контрагенты загружены");
	
	Оповестить("ОбновитьФорму");
	
КонецПроцедуры

&НаСервере
Функция СкачатьШаблонНаСервере()
	
	ВременноеИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
	МакетСДанными = ПолучитьОбщийМакет("ШаблонФайлаКонтрагентов");
	МакетСДанными.Записать(ВременноеИмяФайла);
	Возврат ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВременноеИмяФайла), ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура СкачатьШаблон(Команда)
		
	АдресФайла = СкачатьШаблонНаСервере();
	ВременноеИмя = "Шаблон файла контрагентов.xlsx";
    ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНомера(Команда)
	
	НомерСтроки = 2;
	Объект.НомерКолонкиНаименование = 1;
	Объект.НомерКолонкиВида = 2;
	НомерКолонкиПолноеНаименование = 3;
	НомерКолонкиСФактическимАдресом = 4;	
	НомерКолонкиСТелефоном = 5;
	НомерКолонкиСEMail = 6;
	НомерКолонкиСИНН = 7;
	НомерКолонкиСКПП = 8;
	НомерКолонкиСДатойРождения = 9;
	НомерКолонкиСКомментарием = 10;
	
КонецПроцедуры
